# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

pd.set_option("display.max_columns", None)
pd.set_option("display.float_format", "{:.2f}".format)

### Step 2. Create the DataFrame with the following values:

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [3]:
regiment = pd.DataFrame(raw_data)
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [4]:
regiment.groupby(by=['regiment'])[['preTestScore']].mean().loc[['Nighthawks'], :]

            preTestScore
regiment
Nighthawks         15.25

### Step 5. Present general statistics by company

In [5]:
regiment.groupby(by=['company'])[regiment.select_dtypes(include=np.number).columns].describe(percentiles=np.linspace(0.1,1,10)).T

company               1st   2nd
preTestScore  count  6.00  6.00
              mean   6.67 15.50
              std    8.52 14.65
              min    2.00  2.00
              10%    2.50  2.00
              20%    3.00  2.00
              30%    3.00  2.50
              40%    3.00  3.00
              50%    3.50 13.50
              60%    4.00 24.00
              70%    4.00 27.50
              80%    4.00 31.00
              90%   14.00 31.00
              100%  24.00 31.00
              max   24.00 31.00
postTestScore count  6.00  6.00
              mean  57.67 67.00
              std   27.49 14.06
              min   25.00 57.00
              10%   25.00 57.00
              20%   25.00 57.00
              30%   43.50 59.50
              40%   62.00 62.00
              50%   66.00 62.00
              60%   70.00 62.00
              70%   70.00 66.00
              80%   70.00 70.00
              90%   82.00 82.00
              100%  94.00 94.00
              max   94.00 94.00

### Step 6. What is the mean of each company's preTestScore?

In [6]:
regiment.groupby('company')['preTestScore'].mean()

company
1st    6.67
2nd   15.50
Name: preTestScore, dtype: float64

### Step 7. Present the mean preTestScores grouped by regiment and company

In [7]:
regiment.groupby(by=['regiment', 'company'])[['preTestScore']].mean()

                    preTestScore
regiment   company
Dragoons   1st              3.50
           2nd             27.50
Nighthawks 1st             14.00
           2nd             16.50
Scouts     1st              2.50
           2nd              2.50

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [8]:
display(regiment.groupby(by=['regiment', 'company'])[['preTestScore']].mean())
display(regiment.groupby(by=['regiment', 'company'])[['preTestScore']].mean().unstack())

                    preTestScore
regiment   company
Dragoons   1st              3.50
           2nd             27.50
Nighthawks 1st             14.00
           2nd             16.50
Scouts     1st              2.50
           2nd              2.50

           preTestScore
company             1st   2nd
regiment
Dragoons           3.50 27.50
Nighthawks        14.00 16.50
Scouts             2.50  2.50

### Step 9. Group the entire dataframe by regiment and company

In [9]:
regiment.groupby(by=['regiment', 'company'])

### Step 10. What is the number of observations in each regiment and company

In [10]:
regiment.groupby(by=['regiment', 'company']).count()

                    name  preTestScore  postTestScore
regiment   company
Dragoons   1st         2             2              2
           2nd         2             2              2
Nighthawks 1st         2             2              2
           2nd         2             2              2
Scouts     1st         2             2              2
           2nd         2             2              2

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [11]:
# Group the dataframe by regiment, and for each regiment,
for name, group in regiment.groupby('regiment'):
    # print the name of the regiment
    print(name)
    # print the data of that regiment
    print(group)

Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70